<a href="https://colab.research.google.com/github/nptikiran/PythonBasic/blob/Branch1/Pd_DF.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Import basic Libraries
import pandas as pd
import numpy as np

Import the data and see the data.

In [1]:
# Import the file from local system
from google.colab import files
uploaded = files.upload()

Saving pandas_ex1.csv to pandas_ex1.csv

In [2]:
df = pd.read_csv('pandas_ex1.csv')

NameError: ignored

In [2]:
df = pd.read_csv('/content/pandas_ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Overriding the the column by another name. Changing columns name is useful when their is gap between word of each column name or column name is too long and we want to shorten it.

Here we have change the column name from a,b,c,d  to col1,col2,col3,col4.

In [3]:
# Overriding the column name by another name
df = pd.read_csv('/content/pandas_ex1.csv', names=['col1','col2','col3','col4','col5'])
df

  col1 col2 col3 col4     col5
0    a    b    c    d  message
1    1    2    3    4    hello
2    5    6    7    8    world
3    9   10   11   12      foo

Here we have change the column name with none. It takes default name as 0,1,2,3,4.

In [4]:
# Column name with no Header.
df = pd.read_csv('/content/pandas_ex1.csv', header = None)
df

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

Here we make message as a index column.

In [7]:
# Suppose we want column name to be index
df = pd.read_csv('/content/pandas_ex1.csv', index_col='message')
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

## Handling missing values

usually missing data either not present (empty string) or marked by some sentinel values(default values).Pandas uses a set of commonly occuring sentinels, such as NA, NULL:

foo == forward Observation Officer

In [8]:
df = pd.read_csv('/content/pandas_ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In above table we have add 4th row as NaN.

In [16]:
# In below code we added 3rd row.
df.loc[3] = ({'a':'NaN',
                          'b':'NaN',
                          'c': 4.0,
                          'd': 'Globe',
                          'message':'NaN'})
df

     a    b     c      d message
0    1    2   3.0      4   hello
1    5    6   7.0      8   world
2    9   10  11.0     12     foo
3  NaN  NaN   4.0  Globe     NaN

Here we added 5th row with all NaN values.

In [17]:
#In below code we added 4th row.
df.loc[4] = ({'a':'NaN','b':'NaN','c':'NaN','d':'NaN','message':'Earth'})
df

     a    b    c      d message
0    1    2    3      4   hello
1    5    6    7      8   world
2    9   10   11     12     foo
3  NaN  NaN    4  Globe     NaN
4  NaN  NaN  NaN    NaN   Earth

Add column 'Something' with string values.

In [18]:
# Added column in df
df['something'] = ['one','two','three','four','five']
df

     a    b    c      d message something
0    1    2    3      4   hello       one
1    5    6    7      8   world       two
2    9   10   11     12     foo     three
3  NaN  NaN    4  Globe     NaN      four
4  NaN  NaN  NaN    NaN   Earth      five

Set the something as a index column.

In [25]:
df.set_index('something')

             a    b    c      d message
something
one          1    2    3      4   hello
two          5    6    7      8   world
three        9   10   11     12     foo
four       NaN  NaN    4  Globe     NaN
five       NaN  NaN  NaN    NaN   Earth

## FInding missing values

In [1]:
# Checking for null values
df.isnull()

NameError: ignored

In [27]:
#Checking for null values
pd.isnull(df)

       a      b      c      d  message  something
0  False  False  False  False    False      False
1  False  False  False  False    False      False
2  False  False  False  False    False      False
3  False  False  False  False    False      False
4  False  False  False  False    False      False

In [28]:
#Checking null values at column 'a'
pd.isnull(df['a'])

0    False
1    False
2    False
3    False
4    False
Name: a, dtype: bool

In [30]:
# drop the null values. it we specify 'all' then it drop the null values of a row where all the values are null
df.dropna(how ='all')

     a    b    c      d message something
0    1    2    3      4   hello       one
1    5    6    7      8   world       two
2    9   10   11     12     foo     three
3  NaN  NaN    4  Globe     NaN      four
4  NaN  NaN  NaN    NaN   Earth      five

In [31]:
# It removes the all rows which contain null values.
df.dropna()

     a    b    c      d message something
0    1    2    3      4   hello       one
1    5    6    7      8   world       two
2    9   10   11     12     foo     three
3  NaN  NaN    4  Globe     NaN      four
4  NaN  NaN  NaN    NaN   Earth      five

In [33]:
# Creat new table to remove null values
from numpy import nan as NA

df = pd.DataFrame([[1.,6.5,3.],
                  [1, NA, NA],
                  [NA,NA,NA],
                  [NA,6.5,3]])
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

It remove all rows has na values

In [34]:
# Drop null values 
df.dropna()

     0    1    2
0  1.0  6.5  3.0

It remove only rows which has na values in all places (columns)

In [35]:
# drop null values in the row where all the values are null
df.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [37]:
# creating new DataFrame with array
df = pd.DataFrame(np.random.randn(7,3), columns=['a','b','c'])
df

          a         b         c
0  0.664667  0.468374 -0.484857
1  1.917069  0.866952 -1.347753
2 -1.359338  0.848662  1.048083
3 -1.190092 -0.924513  0.022125
4 -0.407310  1.107985 -0.583943
5  1.131992  2.304797 -0.919264
6  0.869406  0.164349 -1.184526

fill the column with Nan values & it permanantly changes values to Nan
|

In [40]:
# Change the values to null
df.iloc[:4,1] = NA
df

          a         b         c
0  0.664667       NaN -0.484857
1  1.917069       NaN -1.347753
2 -1.359338       NaN  1.048083
3 -1.190092       NaN  0.022125
4 -0.407310  1.107985 -0.583943
5  1.131992  2.304797 -0.919264
6  0.869406  0.164349 -1.184526

In [41]:
# Change values to null
df.iloc[:2,2] = NA
df

          a         b         c
0  0.664667       NaN       NaN
1  1.917069       NaN       NaN
2 -1.359338       NaN  1.048083
3 -1.190092       NaN  0.022125
4 -0.407310  1.107985 -0.583943
5  1.131992  2.304797 -0.919264
6  0.869406  0.164349 -1.184526

Drop Nan values

In [42]:
# dropna values
df.dropna()

          a         b         c
4 -0.407310  1.107985 -0.583943
5  1.131992  2.304797 -0.919264
6  0.869406  0.164349 -1.184526

Fill null values with some value.These values can be mean, median, mode. It's depend on column values.

In [ ]:
# Fill the null values
df.fillna(0)

In [55]:
# It fill the null value with back values
df.fillna(method='bfill')

          0         1         2
0 -0.382084  0.741112  0.574860
1  1.222472 -0.740999 -2.013361
2  0.959182       NaN -0.946067
3 -0.053174       NaN -1.234032
4  1.354264       NaN       NaN
5 -2.442845       NaN       NaN

In [44]:
df

          a         b         c
0  0.664667       NaN       NaN
1  1.917069       NaN       NaN
2 -1.359338       NaN  1.048083
3 -1.190092       NaN  0.022125
4 -0.407310  1.107985 -0.583943
5  1.131992  2.304797 -0.919264
6  0.869406  0.164349 -1.184526

In [54]:
#Fill null values with back values with permanant change.(inplace=True, this means permanat change in table)
df.fillna(method='bfill', inplace=True)
df

          0         1         2
0 -0.382084  0.741112  0.574860
1  1.222472 -0.740999 -2.013361
2  0.959182       NaN -0.946067
3 -0.053174       NaN -1.234032
4  1.354264       NaN       NaN
5 -2.442845       NaN       NaN

In [48]:
# New dataframe with array
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -0.382084  0.741112  0.574860
1  1.222472 -0.740999 -2.013361
2  0.959182  0.035943 -0.946067
3 -0.053174  1.312718 -1.234032
4  1.354264  2.542950 -1.249075
5 -2.442845 -0.816233 -0.126216

In [50]:
#Fil the values with null values
df.iloc[2:,1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.382084  0.741112  0.574860
1  1.222472 -0.740999 -2.013361
2  0.959182       NaN -0.946067
3 -0.053174       NaN -1.234032
4  1.354264       NaN       NaN
5 -2.442845       NaN       NaN

In [52]:
#Fill the null values with forward fill values
df.fillna(method='ffill')

          0         1         2
0 -0.382084  0.741112  0.574860
1  1.222472 -0.740999 -2.013361
2  0.959182 -0.740999 -0.946067
3 -0.053174 -0.740999 -1.234032
4  1.354264 -0.740999 -1.234032
5 -2.442845 -0.740999 -1.234032

In [62]:
# DataFrame with list 
df = pd.DataFrame([[1,2],
                  [2,3],
                  [2,3],
                  [1,2],
                  [4,5],
                  [6,7],
                  [8,9]])
df

   0  1
0  1  2
1  2  3
2  2  3
3  1  2
4  4  5
5  6  7
6  8  9

In [63]:
# Check for duplicated value
df.duplicated()

0    False
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

Remove the duplicates.Only keep first one.

In [64]:
# Drop duplicate values
df.drop_duplicates()

   0  1
0  1  2
1  2  3
4  4  5
5  6  7
6  8  9

Remove the duplicates by keeping only last one.

In [65]:
# Drop duplicates by keeping last
df.drop_duplicates(keep='last')

   0  1
2  2  3
3  1  2
4  4  5
5  6  7
6  8  9